"""Підсписком (sublist) називають список, що є складовою більшого списку. Підсписок може
 містити один елемент, множину елементів або бути порожнім.
Наприклад, [1], [2], [3] та [4] є підписками списку [1, 2, 3, 4]. Список [2, 3]
 також входить до складу [1, 2, 3, 4], але при цьому список [2, 4] не є підсписком
  [1, 2, 3, 4], оскільки у вихідному списку числа 2 і 4 не є сусідами.
Порожній список є підсписком будь-якого списку.
Напишіть функцію all_sub_lists, що повертає список, який містить всі можливі підписки заданого.
Наприклад, якщо функції передано аргумент список [1, 2, 3], то функція має повернути наступний 
список: [[], [1], [2], [3], [1, 2], [2, 3], [1, 2, 3]].
Функція all_sub_lists повинна повертати щонайменше один список з порожнім підписом [[]]."""

def all_sub_lists(data):
    new_list = []
    new_list.append([])
    for i in data:
        new_list.append([i])
    k = len(data)
    n = 2
    while n <= k:
        #new_list.append(data[0:n])
        k_var = k - n
        for l in range(k_var+1):
            new_list.append(data[l:n+l])
        n = n + 1
    return new_list

print(all_sub_lists([4, 6, 1, 3]))
    